Documents/СтоимостьИзделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СтоимостьИзделия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Замер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изделие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изделия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Двери</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дверь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Двери</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДеталей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавленоВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяЗакупочная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Внутренняя</Name>
					<Comment>Цена реализации между подразделениями</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Розничная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДеталей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыДеталей</Name>
			<Comment>Виды деталей в стоимости изделия</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛДСПосн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛДСПдоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка2ммОсн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка2ммДоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка05ммОсн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка05ммДоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрубаХром</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВешалоТорцевое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолкаСотовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кронштейн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПетляПростая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПетляУгловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Направляющие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Крючки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Софиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трансформатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НогаХром</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Туканы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДВП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтеклоДляПолки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯщикВыдвижной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФасадАГТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Джокер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФасадПолукруглый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консоль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штангодержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фланец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиДизайнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугаГравировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажЗаднейСтенки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажКоробаПотолочного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажКоробаВертикального</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопДетали</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СтоимостьИзделия/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ЦенаДвери(Дверь, Дата)
	Цена = Справочники.Двери.ПолучитьЦенуДвери(Дверь, Дата);
	Возврат Цена; 
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(Дата, Подразделение, Номенклатура)
	
	Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(Дата, Новый Структура("Подразделение, Номенклатура", Подразделение, Номенклатура));
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьОтбор(Группа) 
	
	Если Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.ЛДСПосн")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.ЛДСПдоп") Тогда
		НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.ЛДСП16");
		
	ИначеЕсли Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Кант") Тогда
		НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Кант");
		
	ИначеЕсли Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Кромка2ммОсн")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Кромка2ммДоп")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Кромка05ммОсн")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Кромка05ммДоп") Тогда
		НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Кромка");
		
	ИначеЕсли Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.ПетляПростая")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.ПетляУгловая") Тогда
		НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Петли");
		
	ИначеЕсли Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.ПолкаСотовая")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Корзина") Тогда
		НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.СотовыеЭлементы");
		
	ИначеЕсли Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Ручка") Тогда
		НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Ручка");
		
	ИначеЕсли Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Направляющие") Тогда
		НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Направляющие");
		
		//ИначеЕсли Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Софиты")
		//	ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Трансформатор") Тогда
		//	НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Электрика");
		
	ИначеЕсли Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.ТрубаХром")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.ВешалоТорцевое")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Кронштейн")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Крючки")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.НогаХром")
		ИЛИ Группа = ПредопределенноеЗначение("Перечисление.ВидыДеталей.Туканы") Тогда
		НоменклатурнаяГруппа = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.Фурнитура");
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	|	И Номенклатура.Базовый";
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если НЕ РаботаСФайламиКлиент.МожноЗакрытьФормуСФайлами(Объект.Ссылка) Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРабочегоКаталога(Команда)
	РаботаСФайламиКлиент.ОткрытьФормуНастройкиРабочегоКаталога(Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСканирования(Команда)
	РаботаСФайламиКлиент.ОткрытьФормуНастройкиСканирования(Истина);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент = Неопределено)
	Объект.СуммаДокумента = Объект.Номенклатура.Итог("Стоимость") + 
	Объект.Двери.Итог("Стоимость");
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "Цены номенклатуры будут изменены." + Символы.ПС + "Продолжить?" ;
	
	Если Вопрос(Текст, Режим, 0) = КодВозвратаДиалога.Нет Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ТекущиеЦены();
	СуммаДокументаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если (Объект.СуммаДокумента > 0) ИЛИ (Объект.Номенклатура.Итог("Цена") > 0) Тогда
		ТекущиеЦены();
		СуммаДокументаПриИзменении();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТекущиеЦены() 
	
	Количество = Объект.Двери.Количество();
	Если Количество > 0 Тогда
		Для индекс = 1 По Количество Цикл
			Стр = Объект.Двери[Количество - индекс];
			Если НЕ ЗначениеЗаполнено(ЦенаДвери(Стр.Дверь, Объект.Дата)) Тогда
				Объект.Двери.Удалить(Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТЗ = Справочники.Двери.ТекущаяСтоимостьНоменклатуры(Объект.Номенклатура, Объект.Дата, Объект.Подразделение, Ложь);
	Объект.Номенклатура.Загрузить(ТЗ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ <Двери>

&НаКлиенте
Процедура СоздатьДверь(Команда)
	
	СтруктураЗначений = Новый Структура("Подразделение", Объект.Подразделение);
	Форма = ПолучитьФорму("Справочник.Двери.Форма.ФормаЭлемента", Новый Структура("ЗначенияЗаполнения", СтруктураЗначений), ЭтаФорма);
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДверь(Команда)
	
	Форма = ПолучитьФорму("Справочник.Двери.Форма.ФормаВыбора");
	Выбор = Форма.ОткрытьМодально();
	Если Выбор <> Неопределено Тогда
		ДобавитьДверВтч(Выбор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Двери.Форма.ФормаЭлемента" Тогда
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			ДобавитьДверВтч(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДверВтч(Номенклатура) 
	
	Цена = ЦенаДвери(Номенклатура, Объект.Дата);
	Если Цена <> Неопределено Тогда
		НоваяСтрока = Объект.Двери.Добавить();
		НоваяСтрока.Дверь = Номенклатура;
		НоваяСтрока.Стоимость = Цена;
		СуммаДокументаПриИзменении();
	Иначе
		Ответ = Вопрос("Цена двери не актуальна, хотите обновить дату(цену) двери?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ПараметрыФормы = Новый Структура("Ключ", Номенклатура);
			ОткрытьФорму("Справочник.Двери.Форма.ФормаЭлемента", ПараметрыФормы);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвериПослеУдаления(Элемент)
	СуммаДокументаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ДвериВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Двери.Форма.ФормаЭлемента", Новый Структура("Ключ", Элемент.ТекущиеДанные.Дверь));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ <Номенклатура>

&НаКлиенте
Процедура ДобавитьДопДетали(Команда)
	
	Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаВыбора");
	Выбор = Форма.ОткрытьМодально();
	Если Выбор <> Неопределено Тогда
		НоваяСтрока = Объект.Номенклатура.Добавить();
		НоваяСтрока.Номенклатура = Выбор;
		НоваяСтрока.ДобавленоВручную = Истина;
		НоваяСтрока.Деталь = ПредопределенноеЗначение("Перечисление.ВидыДеталей.ДопДетали");
		НоваяСтрока.Цена = ПолучитьЦенуНоменклатуры(Объект.Дата, Объект.Подразделение, Выбор).Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПередУдалением(Элемент, Отказ)
	
	Отказ = НЕ Элемент.ТекущиеДанные.ДобавленоВручную;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Деталь = Элемент.Родитель.ТекущиеДанные.Деталь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(СформироватьОтбор(Деталь));
	Если ДанныеВыбора.Количество() = 0 Тогда
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменклатураПриИзменении(Элемент)
	
	Данные = Элементы.Номенклатура.ТекущиеДанные;
	Если ЗначениеЗаполнено(Данные.Номенклатура) Тогда
		Данные.Цена = ПолучитьЦенуНоменклатуры(Объект.Дата, Объект.Подразделение, Данные.Номенклатура).Значение;
		Данные.Стоимость = Данные.Цена * Данные.Количество;
	Иначе
		Данные.Количество = 0;
		Данные.Стоимость = 0;
		Данные.Цена = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	
	Данные = Элементы.Номенклатура.ТекущиеДанные;
	Данные.Стоимость = Данные.Цена * Данные.Количество;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
